       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADAPTER-DEMO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-FAHRENHEIT PIC 99 VALUE 0.
       01 WS-CELSIUS    PIC 99 VALUE 0.

       PROCEDURE DIVISION.
       MAIN.
           PERFORM READ-FAHRENHEIT
           DISPLAY "legacy=" WS-FAHRENHEIT "F"
           PERFORM READ-CELSIUS
           DISPLAY "adapted=" WS-CELSIUS "C"
           STOP RUN.

       READ-FAHRENHEIT.
           MOVE 86 TO WS-FAHRENHEIT.

       READ-CELSIUS.
           PERFORM READ-FAHRENHEIT
           COMPUTE WS-CELSIUS = ((WS-FAHRENHEIT - 32) * 5) / 9.
