       IDENTIFICATION DIVISION.
       PROGRAM-ID. FactoryMethod.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FACTORY-NAME PIC X(20).
       01 DATABASE-PRODUCT.
          05 CONNECT-MESSAGE PIC X(30).
          05 QUERY-MESSAGE PIC X(30).
       PROCEDURE DIVISION.
           MOVE "CREATEPOSTGRES" TO FACTORY-NAME
           PERFORM USE-DATABASE
           MOVE "CREATEMYSQL" TO FACTORY-NAME
           PERFORM USE-DATABASE
           STOP RUN.

       USE-DATABASE SECTION.
           INITIALIZE DATABASE-PRODUCT
           CALL FACTORY-NAME USING DATABASE-PRODUCT
           DISPLAY FUNCTION TRIM(CONNECT-MESSAGE)
           DISPLAY FUNCTION TRIM(QUERY-MESSAGE)
           .
       END PROGRAM FactoryMethod.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREATEPOSTGRES.
       DATA DIVISION.
       LINKAGE SECTION.
       01 DATABASE-PRODUCT.
          05 CONNECT-MESSAGE PIC X(30).
          05 QUERY-MESSAGE PIC X(30).
       PROCEDURE DIVISION USING DATABASE-PRODUCT.
           MOVE "PostgreSQL connect" TO CONNECT-MESSAGE
           MOVE "PostgreSQL query" TO QUERY-MESSAGE
           GOBACK.
       END PROGRAM CREATEPOSTGRES.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. CREATEMYSQL.
       DATA DIVISION.
       LINKAGE SECTION.
       01 DATABASE-PRODUCT.
          05 CONNECT-MESSAGE PIC X(30).
          05 QUERY-MESSAGE PIC X(30).
       PROCEDURE DIVISION USING DATABASE-PRODUCT.
           MOVE "MySQL connect" TO CONNECT-MESSAGE
           MOVE "MySQL query" TO QUERY-MESSAGE
           GOBACK.
       END PROGRAM CREATEMYSQL.
