ACTIVE-OBJECT-PATTERN.
    MOVE 1 TO VALUE-ITEM(1)
    MOVE 2 TO VALUE-ITEM(2)
    MOVE 0 TO VALUE-N
    PERFORM VARYING INDEX-N FROM 1 BY 1 UNTIL INDEX-N > 2
        EVALUATE VALUE-ITEM(INDEX-N)
            WHEN 1 ADD 3 TO VALUE-N
            WHEN 2 MULTIPLY 4 BY VALUE-N
        END-EVALUATE
    END-PERFORM
    IF VALUE-N = 12 PERFORM PASS ELSE PERFORM FAIL END-IF.
