BROKER-PATTERN.
    MOVE 1 TO AUX-N
    EVALUATE AUX-N WHEN 1 MOVE 7 TO BALANCE WHEN 2 MOVE 1 TO BALANCE END-EVALUATE
    IF BALANCE NOT = 7 PERFORM FAIL END-IF
    MOVE 2 TO AUX-N
    EVALUATE AUX-N WHEN 1 MOVE 7 TO BALANCE WHEN 2 MOVE 1 TO BALANCE END-EVALUATE
    IF BALANCE = 1 PERFORM PASS ELSE PERFORM FAIL END-IF.
