CLIENT-SERVER-PATTERN.
    MOVE 1 TO VALUE-N
    IF VALUE-N = 1 MOVE 200 TO BALANCE MOVE 7 TO STOCK
    ELSE MOVE 404 TO BALANCE MOVE 0 TO STOCK END-IF
    IF BALANCE = 200 AND STOCK = 7 PERFORM PASS ELSE PERFORM FAIL END-IF.
