DATA-MAPPER-PATTERN.
    MOVE 8 TO VALUE-N
    COMPUTE BALANCE = 1000 + VALUE-N
    COMPUTE STOCK = BALANCE - 1000
    IF BALANCE = 1008 AND STOCK = 8 PERFORM PASS ELSE PERFORM FAIL END-IF.
