DEPENDENCY-INJECTION-PATTERN.
    MOVE 1000 TO VALUE-N
    COMPUTE BALANCE = 5000 + VALUE-N
    IF BALANCE = 6000 PERFORM PASS ELSE PERFORM FAIL END-IF.
