DISTRIBUTED-PROXY-PATTERN.
    MOVE 1 TO VALUE-N
    PERFORM DISTRIBUTED-PROXY-REMOTE
    IF BALANCE NOT = 7 PERFORM FAIL END-IF
    MOVE 999 TO VALUE-N
    PERFORM DISTRIBUTED-PROXY-REMOTE
    IF BALANCE = 0 PERFORM PASS ELSE PERFORM FAIL END-IF.
DISTRIBUTED-PROXY-REMOTE.
    IF VALUE-N = 1 MOVE 7 TO BALANCE ELSE MOVE 0 TO BALANCE END-IF.
