DOCUMENT-VIEW-PATTERN.
    MOVE 7 TO VALUE-N
    MOVE 120 TO STOCK
    MOVE STOCK TO BALANCE
    MOVE VALUE-N TO AUX-N
    IF BALANCE = 120 AND AUX-N = 7 PERFORM PASS ELSE PERFORM FAIL END-IF.
