ENTERPRISE-FACADE-PATTERN.
    MOVE 77 TO VALUE-N
    COMPUTE BALANCE = 1000 + VALUE-N
    COMPUTE STOCK = 2000 + VALUE-N
    IF BALANCE = 1077 AND STOCK = 2077 PERFORM PASS ELSE PERFORM FAIL END-IF.
