ENTERPRISE-ADAPTER-PATTERN.
    MOVE 17 TO AUX-N
    MOVE 1250 TO VALUE-N
    DIVIDE 100 INTO VALUE-N GIVING BALANCE REMAINDER STOCK
    IF AUX-N = 17 AND BALANCE = 12 AND STOCK = 50 PERFORM PASS ELSE PERFORM FAIL END-IF.
