INTERPRETER-PATTERN.
    MOVE 2 TO AUX-N
    EVALUATE AUX-N
        WHEN 1 COMPUTE VALUE-N = 3 + 4
        WHEN 2 COMPUTE VALUE-N = 3 * 4
    END-EVALUATE
    MOVE 1 TO AUX-N
    EVALUATE AUX-N
        WHEN 1 COMPUTE VALUE-N = 7 + VALUE-N
        WHEN 2 COMPUTE VALUE-N = 7 * VALUE-N
    END-EVALUATE
    IF VALUE-N = 19 PERFORM PASS ELSE PERFORM FAIL END-IF.
