LAZY-INITIALIZATION-PATTERN.
    MOVE 0 TO BUILDS
    MOVE 0 TO AUX-N
    IF AUX-N = 0 ADD 1 TO BUILDS MOVE 1 TO AUX-N MOVE 42 TO VALUE-N END-IF
    IF AUX-N = 0 ADD 1 TO BUILDS MOVE 1 TO AUX-N MOVE 42 TO VALUE-N END-IF
    IF AUX-N = 1 AND BUILDS = 1 AND VALUE-N = 42 PERFORM PASS ELSE PERFORM FAIL END-IF.
