LEADER-FOLLOWERS-PATTERN.
    MOVE 1 TO VALUE-ITEM(1) MOVE 2 TO VALUE-ITEM(2) MOVE 3 TO VALUE-ITEM(3)
    PERFORM VARYING INDEX-N FROM 1 BY 1 UNTIL INDEX-N > 3
        MOVE VALUE-ITEM(INDEX-N) TO SEEN-ITEM(INDEX-N)
    END-PERFORM
    IF SEEN-ITEM(1) = 1 AND SEEN-ITEM(2) = 2 AND SEEN-ITEM(3) = 3
        PERFORM PASS ELSE PERFORM FAIL END-IF.
