MICROSERVICES-PATTERN.
    MOVE 7 TO STOCK
    MOVE 2 TO VALUE-N
    IF VALUE-N <= STOCK
        SUBTRACT VALUE-N FROM STOCK
        MOVE 1 TO AUX-N
    ELSE
        MOVE 0 TO AUX-N
    END-IF
    IF AUX-N = 1 AND STOCK = 5 PERFORM PASS ELSE PERFORM FAIL END-IF.
