MICROKERNEL-PATTERN.
    MOVE 1 TO VALUE-ITEM(1)
    MOVE 2 TO VALUE-ITEM(2)
    MOVE VALUE-ITEM(1) TO AUX-N
    EVALUATE AUX-N WHEN 1 COMPUTE BALANCE = 4 * 2 WHEN 2 COMPUTE BALANCE = 4 * 4 END-EVALUATE
    MOVE VALUE-ITEM(2) TO AUX-N
    EVALUATE AUX-N WHEN 1 COMPUTE STOCK = 4 * 2 WHEN 2 COMPUTE STOCK = 4 * 4 END-EVALUATE
    IF BALANCE = 8 AND STOCK = 16 PERFORM PASS ELSE PERFORM FAIL END-IF.
