MONITOR-OBJECT-PATTERN.
    MOVE 0 TO VALUE-N
    MOVE 0 TO BUILDS
    IF BUILDS = 0
        MOVE 1 TO BUILDS
        ADD 2 TO VALUE-N
        MOVE 0 TO BUILDS
    ELSE PERFORM FAIL END-IF
    IF BUILDS = 0
        MOVE 1 TO BUILDS
        ADD 3 TO VALUE-N
        MOVE 0 TO BUILDS
    ELSE PERFORM FAIL END-IF
    IF VALUE-N = 5 AND BUILDS = 0 PERFORM PASS ELSE PERFORM FAIL END-IF.
