MVC-PATTERN.
    MOVE 0 TO VALUE-N
    MOVE VALUE-N TO BALANCE
    ADD 1 TO VALUE-N
    IF BALANCE = 0 AND VALUE-N = 1 PERFORM PASS ELSE PERFORM FAIL END-IF.
