MVVM-PATTERN.
    MOVE 10 TO VALUE-N
    MOVE VALUE-N TO BALANCE
    ADD 5 TO VALUE-N
    IF BALANCE = 10 AND VALUE-N = 15 PERFORM PASS ELSE PERFORM FAIL END-IF.
