NULL-OBJECT-PATTERN.
    MOVE 0 TO AUX-N
    MOVE SPACES TO TEXT-A
    EVALUATE AUX-N WHEN 0 MOVE SPACES TO TEXT-A WHEN 1 MOVE "log:x" TO TEXT-A END-EVALUATE
    IF TEXT-A NOT = SPACES PERFORM FAIL END-IF
    MOVE 1 TO AUX-N
    EVALUATE AUX-N WHEN 0 MOVE SPACES TO TEXT-A WHEN 1 MOVE "log:x" TO TEXT-A END-EVALUATE
    IF TEXT-A(1:5) = "log:x" PERFORM PASS ELSE PERFORM FAIL END-IF.
