OBJECT-POOL-PATTERN.
    MOVE 1 TO VALUE-ITEM(1) MOVE 2 TO VALUE-ITEM(2)
    MOVE 2 TO AUX-N
    MOVE VALUE-ITEM(AUX-N) TO VALUE-N
    SUBTRACT 1 FROM AUX-N
    ADD 1 TO AUX-N
    MOVE VALUE-N TO VALUE-ITEM(AUX-N)
    IF VALUE-N = 2 AND AUX-N = 2 AND VALUE-ITEM(2) = 2 PERFORM PASS ELSE PERFORM FAIL END-IF.
