OBSERVER-PATTERN.
    MOVE 42 TO VALUE-N
    COMPUTE BALANCE = 1000 + VALUE-N
    COMPUTE STOCK = 2000 + VALUE-N
    IF BALANCE = 1042 AND STOCK = 2042 PERFORM PASS ELSE PERFORM FAIL END-IF.
