PAC-PATTERN.
    MOVE 40 TO VALUE-N
    MOVE 2 TO AUX-N
    COMPUTE BALANCE = VALUE-N + AUX-N
    MOVE BALANCE TO VALUE-N
    MOVE 0 TO AUX-N
    COMPUTE STOCK = VALUE-N + AUX-N
    IF BALANCE = 42 AND STOCK = 42 PERFORM PASS ELSE PERFORM FAIL END-IF.
