PEER-TO-PEER-PATTERN.
    MOVE 1 TO VALUE-N
    MOVE 2 TO BALANCE
    MOVE 42 TO STOCK
    IF VALUE-N NOT = 1 OR BALANCE NOT = 2 OR STOCK NOT = 42 PERFORM FAIL END-IF
    MOVE 3 TO BALANCE
    IF VALUE-N = 1 AND BALANCE = 3 AND STOCK = 42 PERFORM PASS ELSE PERFORM FAIL END-IF.
