PUBLISH-SUBSCRIBE-PATTERN.
    MOVE 51 TO VALUE-N
    COMPUTE BALANCE = 100 + VALUE-N
    COMPUTE STOCK = 200 + VALUE-N
    IF BALANCE = 151 AND STOCK = 251 PERFORM PASS ELSE PERFORM FAIL END-IF.
