SERVICE-LOCATOR-PATTERN.
    MOVE 1 TO AUX-N
    EVALUATE AUX-N WHEN 1 MOVE 1007 TO BALANCE WHEN 2 MOVE 2007 TO BALANCE END-EVALUATE
    IF BALANCE NOT = 1007 PERFORM FAIL END-IF
    MOVE 2 TO AUX-N
    EVALUATE AUX-N WHEN 1 MOVE 1009 TO BALANCE WHEN 2 MOVE 2009 TO BALANCE END-EVALUATE
    IF BALANCE = 2009 PERFORM PASS ELSE PERFORM FAIL END-IF.
