STATE-PATTERN.
    MOVE 0 TO VALUE-N
    MOVE 2 TO AUX-N
    IF VALUE-N = 0 AND AUX-N = 2 MOVE 1 TO VALUE-N END-IF
    MOVE 1 TO AUX-N
    IF VALUE-N = 1 AND AUX-N = 1 MOVE 0 TO VALUE-N END-IF
    IF VALUE-N = 0 PERFORM PASS ELSE PERFORM FAIL END-IF.
