STRATEGY-PATTERN.
    MOVE 2 TO AUX-N
    EVALUATE AUX-N
        WHEN 1 MOVE 100 TO VALUE-N
        WHEN 2 COMPUTE VALUE-N = 100 * 80 / 100
    END-EVALUATE
    IF VALUE-N NOT = 80 PERFORM FAIL END-IF
    MOVE 1 TO AUX-N
    EVALUATE AUX-N
        WHEN 1 MOVE 100 TO VALUE-N
        WHEN 2 COMPUTE VALUE-N = 100 * 80 / 100
    END-EVALUATE
    IF VALUE-N = 100 PERFORM PASS ELSE PERFORM FAIL END-IF.
