TEMPLATE-METHOD-PATTERN.
    MOVE "read-csv" TO TEXT-A
    MOVE "normalize" TO TEXT-B
    MOVE SPACES TO TEXT-C
    STRING TEXT-A(1:8) DELIMITED BY SIZE ">" DELIMITED BY SIZE
           TEXT-B(1:9) DELIMITED BY SIZE ">publish" DELIMITED BY SIZE
           INTO TEXT-C
    END-STRING
    IF TEXT-C(1:26) = "read-csv>normalize>publish" PERFORM PASS ELSE PERFORM FAIL END-IF.
