UNIT-OF-WORK-PATTERN.
    MOVE 2 TO VALUE-ITEM(1) MOVE 3 TO VALUE-ITEM(2)
    PERFORM VARYING INDEX-N FROM 1 BY 1 UNTIL INDEX-N > 2
        MOVE VALUE-ITEM(INDEX-N) TO SEEN-ITEM(INDEX-N)
        MOVE 0 TO VALUE-ITEM(INDEX-N)
    END-PERFORM
    IF SEEN-ITEM(1) = 2 AND SEEN-ITEM(2) = 3 AND VALUE-ITEM(1) = 0 AND VALUE-ITEM(2) = 0
        PERFORM PASS ELSE PERFORM FAIL END-IF.
