VISITOR-PATTERN.
    MOVE 0 TO BALANCE
    MOVE 1 TO AUX-N
    EVALUATE AUX-N
        WHEN 1 COMPUTE VALUE-N = 3 * 4
        WHEN 2 COMPUTE VALUE-N = 3 * 3
    END-EVALUATE
    ADD VALUE-N TO BALANCE
    MOVE 2 TO AUX-N
    EVALUATE AUX-N
        WHEN 1 COMPUTE VALUE-N = 2 * 4
        WHEN 2 COMPUTE VALUE-N = 3 * 2 * 2
    END-EVALUATE
    ADD VALUE-N TO BALANCE
    IF BALANCE = 24 PERFORM PASS ELSE PERFORM FAIL END-IF.
